STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_cm33.h
/**************  Bit definition for DTS_TS1SDIFRDATAR register  ***************/
#define DTS_TS1SDIFRDATAR_SDIF_RDATA_Pos            (0U)
#define DTS_TS1SDIFRDATAR_SDIF_RDATA_Msk            (0xFFFFFFUL << DTS_TS1SDIFRDATAR_SDIF_RDATA_Pos)      /*!< 0x00FFFFFF */
#define DTS_TS1SDIFRDATAR_SDIF_RDATA                DTS_TS1SDIFRDATAR_SDIF_RDATA_Msk                     /*!< SDIF read data */

/***************  Bit definition for DTS_TS1SDIFDONER register  ***************/
#define DTS_TS1SDIFDONER_SDIF_SMPL_DONE_Pos         (0U)
#define DTS_TS1SDIFDONER_SDIF_SMPL_DONE_Msk         (0x1UL << DTS_TS1SDIFDONER_SDIF_SMPL_DONE_Pos)        /*!< 0x00000001 */
#define DTS_TS1SDIFDONER_SDIF_SMPL_DONE             DTS_TS1SDIFDONER_SDIF_SMPL_DONE_Msk                  /*!< Sample done flag  */

/***************  Bit definition for DTS_TS1SDIFDATAR register  ***************/
#define DTS_TS1SDIFDATAR_SAMPLE_DATA_Pos            (0U)
#define DTS_TS1SDIFDATAR_SAMPLE_DATA_Msk            (0xFFFFUL << DTS_TS1SDIFDATAR_SAMPLE_DATA_Pos)        /*!< 0x0000FFFF */
#define DTS_TS1SDIFDATAR_SAMPLE_DATA                DTS_TS1SDIFDATAR_SAMPLE_DATA_Msk                     /*!< Sample data */
#define DTS_TS1SDIFDATAR_SAMPLE_TYPE_Pos            (16U)
#define DTS_TS1SDIFDATAR_SAMPLE_TYPE_Msk            (0x1UL << DTS_TS1SDIFDATAR_SAMPLE_TYPE_Pos)           /*!< 0x00010000 */
#define DTS_TS1SDIFDATAR_SAMPLE_TYPE                DTS_TS1SDIFDATAR_SAMPLE_TYPE_Msk                     /*!< TS sample type */
#define DTS_TS1SDIFDATAR_SAMPLE_FAULT_Pos           (17U)
#define DTS_TS1SDIFDATAR_SAMPLE_FAULT_Msk           (0x1UL << DTS_TS1SDIFDATAR_SAMPLE_FAULT_Pos)          /*!< 0x00020000 */
#define DTS_TS1SDIFDATAR_SAMPLE_FAULT               DTS_TS1SDIFDATAR_SAMPLE_FAULT_Msk                    /*!< Sample fault */

/**************  Bit definition for DTS_TS1ALARMA_CFGR register  **************/
#define DTS_TS1ALARMA_CFGR_HYSTA_THRESH_Pos         (0U)
#define DTS_TS1ALARMA_CFGR_HYSTA_THRESH_Msk         (0xFFFFUL << DTS_TS1ALARMA_CFGR_HYSTA_THRESH_Pos)     /*!< 0x0000FFFF */
#define DTS_TS1ALARMA_CFGR_HYSTA_THRESH             DTS_TS1ALARMA_CFGR_HYSTA_THRESH_Msk                  /*!< Alarm A hysteresis threshold */
#define DTS_TS1ALARMA_CFGR_ALARMA_THRESH_Pos        (16U)
#define DTS_TS1ALARMA_CFGR_ALARMA_THRESH_Msk        (0xFFFFUL << DTS_TS1ALARMA_CFGR_ALARMA_THRESH_Pos)    /*!< 0xFFFF0000 */
#define DTS_TS1ALARMA_CFGR_ALARMA_THRESH            DTS_TS1ALARMA_CFGR_ALARMA_THRESH_Msk                 /*!< Alarm A threshold */

/***************  Bit definition for DTS_TS1HLSAMPLER register  ***************/
#define DTS_TS1HLSAMPLER_SMPL_LO_Pos                (0U)
#define DTS_TS1HLSAMPLER_SMPL_LO_Msk                (0xFFFFUL << DTS_TS1HLSAMPLER_SMPL_LO_Pos)            /*!< 0x0000FFFF */
#define DTS_TS1HLSAMPLER_SMPL_LO                    DTS_TS1HLSAMPLER_SMPL_LO_Msk                         /*!< Lowest valid data sample value received */
#define DTS_TS1HLSAMPLER_SMPL_HI_Pos                (16U)
#define DTS_TS1HLSAMPLER_SMPL_HI_Msk                (0xFFFFUL << DTS_TS1HLSAMPLER_SMPL_HI_Pos)            /*!< 0xFFFF0000 */
#define DTS_TS1HLSAMPLER_SMPL_HI                    DTS_TS1HLSAMPLER_SMPL_HI_Msk                         /*!< Highest valid data sample value received */

/**************  Bit definition for DTS_TS1HILORESETR register  ***************/
#define DTS_TS1HILORESETR_SMPL_LO_SET_Pos           (0U)
#define DTS_TS1HILORESETR_SMPL_LO_SET_Msk           (0x1UL << DTS_TS1HILORESETR_SMPL_LO_SET_Pos)          /*!< 0x00000001 */
#define DTS_TS1HILORESETR_SMPL_LO_SET               DTS_TS1HILORESETR_SMPL_LO_SET_Msk                    /*!< Sample Low Set */
#define DTS_TS1HILORESETR_SMPL_HI_CLR_Pos           (1U)
#define DTS_TS1HILORESETR_SMPL_HI_CLR_Msk           (0x1UL << DTS_TS1HILORESETR_SMPL_HI_CLR_Pos)          /*!< 0x00000002 */
#define DTS_TS1HILORESETR_SMPL_HI_CLR               DTS_TS1HILORESETR_SMPL_HI_CLR_Msk                    /*!< Sample high clear 0 */

/******************************************************************************/
/*                                                                            */
/*                Ethernet MAC Registers bits definitions                     */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for ETH_MACCR register  ***************/
#define ETH_MACCR_RE_Pos                    (0U)
#define ETH_MACCR_RE_Msk                    (0x1UL << ETH_MACCR_RE_Pos)                          /*!< 0x00000001 */
#define ETH_MACCR_RE                        ETH_MACCR_RE_Msk                                    /*!< Receiver Enable */
#define ETH_MACCR_TE_Pos                    (1U)
#define ETH_MACCR_TE_Msk                    (0x1UL << ETH_MACCR_TE_Pos)                          /*!< 0x00000002 */
#define ETH_MACCR_TE                        ETH_MACCR_TE_Msk                                    /*!< Transmitter Enable */
#define ETH_MACCR_PRELEN_Pos                (2U)
#define ETH_MACCR_PRELEN_Msk                (0x3UL << ETH_MACCR_PRELEN_Pos)                      /*!< 0x0000000C */
#define ETH_MACCR_PRELEN                    ETH_MACCR_PRELEN_Msk                                /*!< Preamble Length for Transmit packets */
#define ETH_MACCR_PRELEN_7                  (0x0UL << ETH_MACCR_PRELEN_Pos)                      /*!< 0x00000000 */
#define ETH_MACCR_PRELEN_5                  (0x1UL << ETH_MACCR_PRELEN_Pos)                      /*!< 0x00000004 */
#define ETH_MACCR_PRELEN_3                  (0x2UL << ETH_MACCR_PRELEN_Pos)                      /*!< 0x00000008 */
#define ETH_MACCR_DC_Pos                    (4U)
#define ETH_MACCR_DC_Msk                    (0x1UL << ETH_MACCR_DC_Pos)                          /*!< 0x00000010 */
#define ETH_MACCR_DC                        ETH_MACCR_DC_Msk                                    /*!< Deferral Check */
#define ETH_MACCR_BL_Pos                    (5U)
#define ETH_MACCR_BL_Msk                    (0x3UL << ETH_MACCR_BL_Pos)                          /*!< 0x00000060 */
#define ETH_MACCR_BL                        ETH_MACCR_BL_Msk                                    /*!< Back-Off Limit */
#define ETH_MACCR_BL_10                     (0x0UL << ETH_MACCR_BL_Pos)                          /*!< 0x00000000 */
#define ETH_MACCR_BL_8                      (0x1UL << ETH_MACCR_BL_Pos)                          /*!< 0x00000020 */
#define ETH_MACCR_BL_4                      (0x2UL << ETH_MACCR_BL_Pos)                          /*!< 0x00000040 */
#define ETH_MACCR_BL_1                      (0x3UL << ETH_MACCR_BL_Pos)                          /*!< 0x00000060 */
#define ETH_MACCR_DR_Pos                    (8U)
#define ETH_MACCR_DR_Msk                    (0x1UL << ETH_MACCR_DR_Pos)                          /*!< 0x00000100 */
#define ETH_MACCR_DR                        ETH_MACCR_DR_Msk                                    /*!< Disable Retry */
#define ETH_MACCR_DCRS_Pos                  (9U)
#define ETH_MACCR_DCRS_Msk                  (0x1UL << ETH_MACCR_DCRS_Pos)                        /*!< 0x00000200 */
#define ETH_MACCR_DCRS                      ETH_MACCR_DCRS_Msk                                  /*!< Disable Carrier Sense During Transmission */
#define ETH_MACCR_DO_Pos                    (10U)
#define ETH_MACCR_DO_Msk                    (0x1UL << ETH_MACCR_DO_Pos)                          /*!< 0x00000400 */
#define ETH_MACCR_DO                        ETH_MACCR_DO_Msk                                    /*!< Disable Receive Own */
#define ETH_MACCR_ECRSFD_Pos                (11U)
#define ETH_MACCR_ECRSFD_Msk                (0x1UL << ETH_MACCR_ECRSFD_Pos)                      /*!< 0x00000800 */
#define ETH_MACCR_ECRSFD                    ETH_MACCR_ECRSFD_Msk                                /*!< Enable Carrier Sense Before Transmission in Full-Duplex Mode */
#define ETH_MACCR_LM_Pos                    (12U)
#define ETH_MACCR_LM_Msk                    (0x1UL << ETH_MACCR_LM_Pos)                          /*!< 0x00001000 */
#define ETH_MACCR_LM                        ETH_MACCR_LM_Msk                                    /*!< Loopback Mode */
#define ETH_MACCR_DM_Pos                    (13U)
#define ETH_MACCR_DM_Msk                    (0x1UL << ETH_MACCR_DM_Pos)                          /*!< 0x00002000 */
#define ETH_MACCR_DM                        ETH_MACCR_DM_Msk                                    /*!< Duplex Mode */
#define ETH_MACCR_FES_Pos                   (14U)
#define ETH_MACCR_FES_Msk                   (0x1UL << ETH_MACCR_FES_Pos)                         /*!< 0x00004000 */
#define ETH_MACCR_FES                       ETH_MACCR_FES_Msk                                   /*!< MAC Speed */
#define ETH_MACCR_PS_Pos                    (15U)
#define ETH_MACCR_PS_Msk                    (0x1UL << ETH_MACCR_PS_Pos)                          /*!< 0x00008000 */
#define ETH_MACCR_PS                        ETH_MACCR_PS_Msk                                    /*!< Port Select */
#define ETH_MACCR_JE_Pos                    (16U)
#define ETH_MACCR_JE_Msk                    (0x1UL << ETH_MACCR_JE_Pos)                          /*!< 0x00010000 */
#define ETH_MACCR_JE                        ETH_MACCR_JE_Msk                                    /*!< Jumbo Packet Enable */
#define ETH_MACCR_JD_Pos                    (17U)
#define ETH_MACCR_JD_Msk                    (0x1UL << ETH_MACCR_JD_Pos)                          /*!< 0x00020000 */
#define ETH_MACCR_JD                        ETH_MACCR_JD_Msk                                    /*!< Jabber Disable */
#define ETH_MACCR_BE_Pos                    (18U)
#define ETH_MACCR_BE_Msk                    (0x1UL << ETH_MACCR_BE_Pos)                          /*!< 0x00040000 */
#define ETH_MACCR_BE                        ETH_MACCR_BE_Msk                                    /*!< Packet Burst Enable */
#define ETH_MACCR_WD_Pos                    (19U)
#define ETH_MACCR_WD_Msk                    (0x1UL << ETH_MACCR_WD_Pos)                          /*!< 0x00080000 */
#define ETH_MACCR_WD                        ETH_MACCR_WD_Msk                                    /*!< Watchdog Disable */
#define ETH_MACCR_ACS_Pos                   (20U)
#define ETH_MACCR_ACS_Msk                   (0x1UL << ETH_MACCR_ACS_Pos)                         /*!< 0x00100000 */
#define ETH_MACCR_ACS                       ETH_MACCR_ACS_Msk                                   /*!< Automatic Pad or CRC Stripping */
#define ETH_MACCR_CST_Pos                   (21U)
#define ETH_MACCR_CST_Msk                   (0x1UL << ETH_MACCR_CST_Pos)                         /*!< 0x00200000 */
#define ETH_MACCR_CST                       ETH_MACCR_CST_Msk                                   /*!< CRC stripping for Type packets */
#define ETH_MACCR_S2KP_Pos                  (22U)
#define ETH_MACCR_S2KP_Msk                  (0x1UL << ETH_MACCR_S2KP_Pos)                        /*!< 0x00400000 */
#define ETH_MACCR_S2KP                      ETH_MACCR_S2KP_Msk                                  /*!< IEEE 802.3as Support for 2K Packets */
#define ETH_MACCR_GPSLCE_Pos                (23U)
#define ETH_MACCR_GPSLCE_Msk                (0x1UL << ETH_MACCR_GPSLCE_Pos)                      /*!< 0x00800000 */
#define ETH_MACCR_GPSLCE                    ETH_MACCR_GPSLCE_Msk                                /*!< Giant Packet Size Limit Control Enable */
#define ETH_MACCR_IPG_Pos                   (24U)
#define ETH_MACCR_IPG_Msk                   (0x7UL << ETH_MACCR_IPG_Pos)                         /*!< 0x07000000 */
#define ETH_MACCR_IPG                       ETH_MACCR_IPG_Msk                                   /*!< Inter-Packet Gap */
#define ETH_MACCR_IPG_96BIT                 (0x0UL << ETH_MACCR_IPG_Pos)                         /*!< 0x00000000 */
#define ETH_MACCR_IPG_88BIT                 (0x1UL << ETH_MACCR_IPG_Pos)                         /*!< 0x01000000 */
#define ETH_MACCR_IPG_80BIT                 (0x2UL << ETH_MACCR_IPG_Pos)                         /*!< 0x02000000 */
#define ETH_MACCR_IPG_72BIT                 (0x3UL << ETH_MACCR_IPG_Pos)                         /*!< 0x03000000 */
#define ETH_MACCR_IPG_64BIT                 (0x4UL << ETH_MACCR_IPG_Pos)                         /*!< 0x04000000 */
#define ETH_MACCR_IPG_56BIT                 (0x5UL << ETH_MACCR_IPG_Pos)                         /*!< 0x05000000 */
#define ETH_MACCR_IPG_48BIT                 (0x6UL << ETH_MACCR_IPG_Pos)                         /*!< 0x06000000 */
#define ETH_MACCR_IPG_40BIT                 (0x7UL << ETH_MACCR_IPG_Pos)                         /*!< 0x07000000 */
#define ETH_MACCR_IPC_Pos                   (27U)
#define ETH_MACCR_IPC_Msk                   (0x1UL << ETH_MACCR_IPC_Pos)                         /*!< 0x08000000 */
#define ETH_MACCR_IPC                       ETH_MACCR_IPC_Msk                                   /*!< Checksum Offload */
#define ETH_MACCR_SARC_Pos                  (28U)
#define ETH_MACCR_SARC_Msk                  (0x7UL << ETH_MACCR_SARC_Pos)                        /*!< 0x70000000 */
#define ETH_MACCR_SARC                      ETH_MACCR_SARC_Msk                                  /*!< Source Address Insertion or Replacement Control */
#define ETH_MACCR_SARC_0                    (0x1UL << ETH_MACCR_SARC_Pos)                        /*!< 0x10000000 */
#define ETH_MACCR_SARC_1                    (0x2UL << ETH_MACCR_SARC_Pos)                        /*!< 0x20000000 */
#define ETH_MACCR_SARC_2                    (0x4UL << ETH_MACCR_SARC_Pos)                        /*!< 0x40000000 */
#define ETH_MACCR_ARPEN_Pos                 (31U)
#define ETH_MACCR_ARPEN_Msk                 (0x1UL << ETH_MACCR_ARPEN_Pos)                       /*!< 0x80000000 */
#define ETH_MACCR_ARPEN                     ETH_MACCR_ARPEN_Msk                                 /*!< ARP Offload Enable */

/**************  Bit definition for ETH_MACECR register  ***************/
#define ETH_MACECR_GPSL_Pos                 (0U)
#define ETH_MACECR_GPSL_Msk                 (0x3FFFUL << ETH_MACECR_GPSL_Pos)                    /*!< 0x00003FFF */
#define ETH_MACECR_GPSL                     ETH_MACECR_GPSL_Msk                                 /*!< Giant Packet Size Limit */
#define ETH_MACECR_GPSL_0                   (0x1UL << ETH_MACECR_GPSL_Pos)                       /*!< 0x00000001 */
#define ETH_MACECR_GPSL_1                   (0x2UL << ETH_MACECR_GPSL_Pos)                       /*!< 0x00000002 */
#define ETH_MACECR_GPSL_2                   (0x4UL << ETH_MACECR_GPSL_Pos)                       /*!< 0x00000004 */
#define ETH_MACECR_GPSL_3                   (0x8UL << ETH_MACECR_GPSL_Pos)                       /*!< 0x00000008 */
#define ETH_MACECR_GPSL_4                   (0x10UL << ETH_MACECR_GPSL_Pos)                      /*!< 0x00000010 */
#define ETH_MACECR_GPSL_5                   (0x20UL << ETH_MACECR_GPSL_Pos)                      /*!< 0x00000020 */
#define ETH_MACECR_GPSL_6                   (0x40UL << ETH_MACECR_GPSL_Pos)                      /*!< 0x00000040 */
#define ETH_MACECR_GPSL_7                   (0x80UL << ETH_MACECR_GPSL_Pos)                      /*!< 0x00000080 */
#define ETH_MACECR_GPSL_8                   (0x100UL << ETH_MACECR_GPSL_Pos)                     /*!< 0x00000100 */
#define ETH_MACECR_GPSL_9                   (0x200UL << ETH_MACECR_GPSL_Pos)                     /*!< 0x00000200 */
#define ETH_MACECR_GPSL_10                  (0x400UL << ETH_MACECR_GPSL_Pos)                     /*!< 0x00000400 */
#define ETH_MACECR_GPSL_11                  (0x800UL << ETH_MACECR_GPSL_Pos)                     /*!< 0x00000800 */
#define ETH_MACECR_GPSL_12                  (0x1000UL << ETH_MACECR_GPSL_Pos)                    /*!< 0x00001000 */
#define ETH_MACECR_GPSL_13                  (0x2000UL << ETH_MACECR_GPSL_Pos)                    /*!< 0x00002000 */
#define ETH_MACECR_DCRCC_Pos                (16U)
#define ETH_MACECR_DCRCC_Msk                (0x1UL << ETH_MACECR_DCRCC_Pos)                      /*!< 0x00010000 */
#define ETH_MACECR_DCRCC                    ETH_MACECR_DCRCC_Msk                                /*!< Disable CRC Checking for Received Packets */
#define ETH_MACECR_SPEN_Pos                 (17U)
#define ETH_MACECR_SPEN_Msk                 (0x1UL << ETH_MACECR_SPEN_Pos)                       /*!< 0x00020000 */
#define ETH_MACECR_SPEN                     ETH_MACECR_SPEN_Msk                                 /*!< Slow Protocol Detection Enable */
#define ETH_MACECR_USP_Pos                  (18U)
#define ETH_MACECR_USP_Msk                  (0x1UL << ETH_MACECR_USP_Pos)                        /*!< 0x00040000 */
#define ETH_MACECR_USP                      ETH_MACECR_USP_Msk                                  /*!< Unicast Slow Protocol Packet Detect */
#define ETH_MACECR_EIPGEN_Pos               (24U)
#define ETH_MACECR_EIPGEN_Msk               (0x1UL << ETH_MACECR_EIPGEN_Pos)                     /*!< 0x01000000 */
#define ETH_MACECR_EIPGEN                   ETH_MACECR_EIPGEN_Msk                               /*!< Extended Inter-Packet Gap Enable */
#define ETH_MACECR_EIPG_Pos                 (25U)
#define ETH_MACECR_EIPG_Msk                 (0x1FUL << ETH_MACECR_EIPG_Pos)                      /*!< 0x3E000000 */
#define ETH_MACECR_EIPG                     ETH_MACECR_EIPG_Msk                                 /*!< Extended Inter-Packet Gap */
#define ETH_MACECR_EIPG_0                   (0x1UL << ETH_MACECR_EIPG_Pos)                       /*!< 0x02000000 */
#define ETH_MACECR_EIPG_1                   (0x2UL << ETH_MACECR_EIPG_Pos)                       /*!< 0x04000000 */
#define ETH_MACECR_EIPG_2                   (0x4UL << ETH_MACECR_EIPG_Pos)                       /*!< 0x08000000 */
#define ETH_MACECR_EIPG_3                   (0x8UL << ETH_MACECR_EIPG_Pos)                       /*!< 0x10000000 */
#define ETH_MACECR_EIPG_4                   (0x10UL << ETH_MACECR_EIPG_Pos)                      /*!< 0x20000000 */
#define ETH_MACECR_APDIM_Pos                (30U)
#define ETH_MACECR_APDIM_Msk                (0x1UL << ETH_MACECR_APDIM_Pos)                       /*!< 0x40000000 */
#define ETH_MACECR_APDIM                    ETH_MACECR_APDIM_Msk                                /*!< ARP Packet Drop if IP Address Mismatch */

/**************  Bit definition for ETH_MACPFR register  ***************/
#define ETH_MACPFR_PR_Pos                   (0U)
#define ETH_MACPFR_PR_Msk                   (0x1UL << ETH_MACPFR_PR_Pos)                         /*!< 0x00000001 */
#define ETH_MACPFR_PR                       ETH_MACPFR_PR_Msk                                   /*!< Promiscuous Mode */
#define ETH_MACPFR_HUC_Pos                  (1U)
#define ETH_MACPFR_HUC_Msk                  (0x1UL << ETH_MACPFR_HUC_Pos)                        /*!< 0x00000002 */
#define ETH_MACPFR_HUC                      ETH_MACPFR_HUC_Msk                                  /*!< Hash Unicast */
#define ETH_MACPFR_HMC_Pos                  (2U)
#define ETH_MACPFR_HMC_Msk                  (0x1UL << ETH_MACPFR_HMC_Pos)                        /*!< 0x00000004 */
#define ETH_MACPFR_HMC                      ETH_MACPFR_HMC_Msk                                  /*!< Hash Multicast */
#define ETH_MACPFR_DAIF_Pos                 (3U)
#define ETH_MACPFR_DAIF_Msk                 (0x1UL << ETH_MACPFR_DAIF_Pos)                       /*!< 0x00000008 */
#define ETH_MACPFR_DAIF                     ETH_MACPFR_DAIF_Msk                                 /*!< DA Inverse Filtering */
#define ETH_MACPFR_PM_Pos                   (4U)
#define ETH_MACPFR_PM_Msk                   (0x1UL << ETH_MACPFR_PM_Pos)                         /*!< 0x00000010 */
#define ETH_MACPFR_PM                       ETH_MACPFR_PM_Msk                                   /*!< Pass All Multicast */
#define ETH_MACPFR_DBF_Pos                  (5U)
#define ETH_MACPFR_DBF_Msk                  (0x1UL << ETH_MACPFR_DBF_Pos)                        /*!< 0x00000020 */
#define ETH_MACPFR_DBF                      ETH_MACPFR_DBF_Msk                                  /*!< Disable Broadcast Packets */
#define ETH_MACPFR_PCF_Pos                  (6U)
#define ETH_MACPFR_PCF_Msk                  (0x3UL << ETH_MACPFR_PCF_Pos)                        /*!< 0x000000C0 */
#define ETH_MACPFR_PCF                      ETH_MACPFR_PCF_Msk                                  /*!< Pass Control Packets */
#define ETH_MACPFR_PCF_BLOCKALL                 (0x0UL << ETH_MACPFR_PCF_Pos)                    /*!< 0x00000000 */
#define ETH_MACPFR_PCF_FORWARDALLEXCEPTPA       (0x1UL << ETH_MACPFR_PCF_Pos)                    /*!< 0x00000010 */
#define ETH_MACPFR_PCF_FORWARDALL               (0x2UL << ETH_MACPFR_PCF_Pos)                    /*!< 0x00000020 */
#define ETH_MACPFR_PCF_FORWARDPASSEDADDRFILTER  (0x3UL << ETH_MACPFR_PCF_Pos)                    /*!< 0x00000030 */
#define ETH_MACPFR_SAIF_Pos                 (8U)
#define ETH_MACPFR_SAIF_Msk                 (0x1UL << ETH_MACPFR_SAIF_Pos)                       /*!< 0x00000100 */
#define ETH_MACPFR_SAIF                     ETH_MACPFR_SAIF_Msk                                 /*!< SA Inverse Filtering */
#define ETH_MACPFR_SAF_Pos                  (9U)
#define ETH_MACPFR_SAF_Msk                  (0x1UL << ETH_MACPFR_SAF_Pos)                        /*!< 0x00000200 */
#define ETH_MACPFR_SAF                      ETH_MACPFR_SAF_Msk                                  /*!< Source Address Filter Enable */
#define ETH_MACPFR_HPF_Pos                  (10U)
#define ETH_MACPFR_HPF_Msk                  (0x1UL << ETH_MACPFR_HPF_Pos)                        /*!< 0x00000400 */
#define ETH_MACPFR_HPF                      ETH_MACPFR_HPF_Msk                                  /*!< Hash or Perfect Filter */
#define ETH_MACPFR_VTFE_Pos                 (16U)
#define ETH_MACPFR_VTFE_Msk                 (0x1UL << ETH_MACPFR_VTFE_Pos)                       /*!< 0x00010000 */
#define ETH_MACPFR_VTFE                     ETH_MACPFR_VTFE_Msk                                 /*!< VLAN Tag Filter Enable */
#define ETH_MACPFR_IPFE_Pos                 (20U)
#define ETH_MACPFR_IPFE_Msk                 (0x1UL << ETH_MACPFR_IPFE_Pos)                       /*!< 0x00100000 */
#define ETH_MACPFR_IPFE                     ETH_MACPFR_IPFE_Msk                                 /*!< Layer 3 and Layer 4 Filter Enable */
#define ETH_MACPFR_DNTU_Pos                 (21U)
#define ETH_MACPFR_DNTU_Msk                 (0x1UL << ETH_MACPFR_DNTU_Pos)                       /*!< 0x00200000 */
#define ETH_MACPFR_DNTU                     ETH_MACPFR_DNTU_Msk                                 /*!< Drop Non-TCP/UDP over IP Packets */
#define ETH_MACPFR_RA_Pos                   (31U)
#define ETH_MACPFR_RA_Msk                   (0x1UL << ETH_MACPFR_RA_Pos)                         /*!< 0x80000000 */
#define ETH_MACPFR_RA                       ETH_MACPFR_RA_Msk                                   /*!< Receive All */

