STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_cm33.h
/****************  Bit definition for LTDC_LxCFBLNR register  *****************/
#define LTDC_LxCFBLNR_CFBLNBR_Pos     (0U)
#define LTDC_LxCFBLNR_CFBLNBR_Msk     (0xFFFFUL << LTDC_LxCFBLNR_CFBLNBR_Pos)           /*!< 0x0000FFFF */
#define LTDC_LxCFBLNR_CFBLNBR         LTDC_LxCFBLNR_CFBLNBR_Msk  /*!< frame buffer line number  */

/****************  Bit definition for LTDC_LxAFBA0R register  *****************/
#define LTDC_LxAFBA0R_AFBADD0_Pos     (0U)
#define LTDC_LxAFBA0R_AFBADD0_Msk     (0xFFFFFFFFUL << LTDC_LxAFBA0R_AFBADD0_Pos)               /*!< 0xFFFFFFFF */
#define LTDC_LxAFBA0R_AFBADD0         LTDC_LxAFBA0R_AFBADD0_Msk  /*!< frame buffer start address */

/****************  Bit definition for LTDC_LxAFBA1R register  *****************/
#define LTDC_LxAFBA1R_AFBADD1_Pos     (0U)
#define LTDC_LxAFBA1R_AFBADD1_Msk     (0xFFFFFFFFUL << LTDC_LxAFBA1R_AFBADD1_Pos)               /*!< 0xFFFFFFFF */
#define LTDC_LxAFBA1R_AFBADD1         LTDC_LxAFBA1R_AFBADD1_Msk  /*!< auxiliary frame buffer start address */

/*****************  Bit definition for LTDC_LxAFBLR register  *****************/
#define LTDC_LxAFBLR_AFBLL_Pos        (0U)
#define LTDC_LxAFBLR_AFBLL_Msk        (0xFFFFUL << LTDC_LxAFBLR_AFBLL_Pos)        /*!< 0x0000FFFF */
#define LTDC_LxAFBLR_AFBLL            LTDC_LxAFBLR_AFBLL_Msk     /*!< auxiliary frame buffer line length */
#define LTDC_LxAFBLR_AFBP_Pos         (16U)
#define LTDC_LxAFBLR_AFBP_Msk         (0xFFFFUL << LTDC_LxAFBLR_AFBP_Pos)       /*!< 0xFFFF0000 */
#define LTDC_LxAFBLR_AFBP             LTDC_LxAFBLR_AFBP_Msk      /*!< auxiliary frame buffer pitch in bytes */

/****************  Bit definition for LTDC_LxAFBLNR register  *****************/
#define LTDC_LxAFBLNR_AFBLNBR_Pos     (0U)
#define LTDC_LxAFBLNR_AFBLNBR_Msk     (0xFFFFUL << LTDC_LxAFBLNR_AFBLNBR_Pos)           /*!< 0x0000FFFF */
#define LTDC_LxAFBLNR_AFBLNBR         LTDC_LxAFBLNR_AFBLNBR_Msk  /*!< auxiliary frame buffer line number  */

/****************  Bit definition for LTDC_LxCLUTWR register  *****************/
#define LTDC_LxCLUTWR_BLUE_Pos        (0U)
#define LTDC_LxCLUTWR_BLUE_Msk        (0xFFUL << LTDC_LxCLUTWR_BLUE_Pos)      /*!< 0x000000FF */
#define LTDC_LxCLUTWR_BLUE            LTDC_LxCLUTWR_BLUE_Msk     /*!< blue value */
#define LTDC_LxCLUTWR_GREEN_Pos       (8U)
#define LTDC_LxCLUTWR_GREEN_Msk       (0xFFUL << LTDC_LxCLUTWR_GREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxCLUTWR_GREEN           LTDC_LxCLUTWR_GREEN_Msk    /*!< green value */
#define LTDC_LxCLUTWR_RED_Pos         (16U)
#define LTDC_LxCLUTWR_RED_Msk         (0xFFUL << LTDC_LxCLUTWR_RED_Pos)     /*!< 0x00FF0000 */
#define LTDC_LxCLUTWR_RED             LTDC_LxCLUTWR_RED_Msk      /*!< red value */
#define LTDC_LxCLUTWR_CLUTADD_Pos     (24U)
#define LTDC_LxCLUTWR_CLUTADD_Msk     (0xFFUL << LTDC_LxCLUTWR_CLUTADD_Pos)         /*!< 0xFF000000 */
#define LTDC_LxCLUTWR_CLUTADD         LTDC_LxCLUTWR_CLUTADD_Msk  /*!< CLUT address */

/*****************  Bit definition for LTDC_LxSISR register  ******************/
#define LTDC_LxSISR_SIH_Pos           (0U)
#define LTDC_LxSISR_SIH_Msk           (0xFFFUL << LTDC_LxSISR_SIH_Pos)    /*!< 0x00000FFF */
#define LTDC_LxSISR_SIH               LTDC_LxSISR_SIH_Msk        /*!< scaler horizontal input size (input width) */
#define LTDC_LxSISR_SIV_Pos           (16U)
#define LTDC_LxSISR_SIV_Msk           (0xFFFUL << LTDC_LxSISR_SIV_Pos)    /*!< 0x0FFF0000 */
#define LTDC_LxSISR_SIV               LTDC_LxSISR_SIV_Msk        /*!< scaler vertical input size (input height) */

/*****************  Bit definition for LTDC_LxSOSR register  ******************/
#define LTDC_LxSOSR_SOH_Pos           (0U)
#define LTDC_LxSOSR_SOH_Msk           (0xFFFUL << LTDC_LxSOSR_SOH_Pos)    /*!< 0x00000FFF */
#define LTDC_LxSOSR_SOH               LTDC_LxSOSR_SOH_Msk        /*!< scaler horizontal output size (output width) */
#define LTDC_LxSOSR_SOV_Pos           (16U)
#define LTDC_LxSOSR_SOV_Msk           (0xFFFUL << LTDC_LxSOSR_SOV_Pos)    /*!< 0x0FFF0000 */
#define LTDC_LxSOSR_SOV               LTDC_LxSOSR_SOV_Msk        /*!< scaler vertical output size (output height) */

/*****************  Bit definition for LTDC_LxSVSFR register  *****************/
#define LTDC_LxSVSFR_SVF_Pos          (0U)
#define LTDC_LxSVSFR_SVF_Msk          (0xFFFFUL << LTDC_LxSVSFR_SVF_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSVSFR_SVF              LTDC_LxSVSFR_SVF_Msk       /*!< scaler vertical scaling factor */

/*****************  Bit definition for LTDC_LxSVSPR register  *****************/
#define LTDC_LxSVSPR_SVP_Pos          (0U)
#define LTDC_LxSVSPR_SVP_Msk          (0xFFFFUL << LTDC_LxSVSPR_SVP_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSVSPR_SVP              LTDC_LxSVSPR_SVP_Msk       /*!< scaler vertical scaling factor */

/*****************  Bit definition for LTDC_LxSHSFR register  *****************/
#define LTDC_LxSHSFR_SHF_Pos          (0U)
#define LTDC_LxSHSFR_SHF_Msk          (0xFFFFUL << LTDC_LxSHSFR_SHF_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSHSFR_SHF              LTDC_LxSHSFR_SHF_Msk       /*!< scaler horizontal scaling factor */

/*****************  Bit definition for LTDC_LxSHSPR register  *****************/
#define LTDC_LxSHSPR_SHP_Pos          (0U)
#define LTDC_LxSHSPR_SHP_Msk          (0xFFFFUL << LTDC_LxSHSPR_SHP_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSHSPR_SHP              LTDC_LxSHSPR_SHP_Msk       /*!< scaler horizontal scaling phase */

/*****************  Bit definition for LTDC_LxCYR0R register  *****************/
#define LTDC_LxCYR0R_CR2R_Pos         (0U)
#define LTDC_LxCYR0R_CR2R_Msk         (0x3FFUL << LTDC_LxCYR0R_CR2R_Pos)      /*!< 0x000003FF */
#define LTDC_LxCYR0R_CR2R             LTDC_LxCYR0R_CR2R_Msk      /*!< Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals */
#define LTDC_LxCYR0R_CB2B_Pos         (16U)
#define LTDC_LxCYR0R_CB2B_Msk         (0x3FFUL << LTDC_LxCYR0R_CB2B_Pos)      /*!< 0x03FF0000 */
#define LTDC_LxCYR0R_CB2B             LTDC_LxCYR0R_CB2B_Msk      /*!< Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals */

/*****************  Bit definition for LTDC_LxCYR1R register  *****************/
#define LTDC_LxCYR1R_CR2G_Pos         (0U)
#define LTDC_LxCYR1R_CR2G_Msk         (0x3FFUL << LTDC_LxCYR1R_CR2G_Pos)      /*!< 0x000003FF */
#define LTDC_LxCYR1R_CR2G             LTDC_LxCYR1R_CR2G_Msk      /*!< Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals */
#define LTDC_LxCYR1R_CB2G_Pos         (16U)
#define LTDC_LxCYR1R_CB2G_Msk         (0x3FFUL << LTDC_LxCYR1R_CB2G_Pos)      /*!< 0x03FF0000 */
#define LTDC_LxCYR1R_CB2G             LTDC_LxCYR1R_CB2G_Msk      /*!< Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals */

/******************************************************************************/
/*                                                                            */
/*                              LDVS unit (LVDS)                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for LVDS_CR register  ********************/
#define LVDS_CR_LVDSEN_Pos                                     (0U)
#define LVDS_CR_LVDSEN_Msk                                     (0x1UL << LVDS_CR_LVDSEN_Pos)                                     /*!< 0x00000001 */
#define LVDS_CR_LVDSEN                                         LVDS_CR_LVDSEN_Msk                                               /*!< LVDS PHY Enable */
#define LVDS_CR_HSPOL_Pos                                      (1U)
#define LVDS_CR_HSPOL_Msk                                      (0x1UL << LVDS_CR_HSPOL_Pos)                                      /*!< 0x00000002 */
#define LVDS_CR_HSPOL                                          LVDS_CR_HSPOL_Msk                                                /*!< HS Polarity (polarity of the horizontal synchronisation) */
#define LVDS_CR_VSPOL_Pos                                      (2U)
#define LVDS_CR_VSPOL_Msk                                      (0x1UL << LVDS_CR_VSPOL_Pos)                                      /*!< 0x00000004 */
#define LVDS_CR_VSPOL                                          LVDS_CR_VSPOL_Msk                                                /*!< VS Polarity (polarity of the vertical synchronization) */
#define LVDS_CR_DEPOL_Pos                                      (3U)
#define LVDS_CR_DEPOL_Msk                                      (0x1UL << LVDS_CR_DEPOL_Pos)                                      /*!< 0x00000008 */
#define LVDS_CR_DEPOL                                          LVDS_CR_DEPOL_Msk                                                /*!< DE Polarity (polarity of the data enable) */
#define LVDS_CR_CI_Pos                                         (4U)
#define LVDS_CR_CI_Msk                                         (0x1UL << LVDS_CR_CI_Pos)                                         /*!< 0x00000010 */
#define LVDS_CR_CI                                             LVDS_CR_CI_Msk                                                   /*!< Control Internal (software controlled bit, that can be inserted among output data) */
#define LVDS_CR_LKMOD_Pos                                      (5U)
#define LVDS_CR_LKMOD_Msk                                      (0x1UL << LVDS_CR_LKMOD_Pos)                                      /*!< 0x00000020 */
#define LVDS_CR_LKMOD                                          LVDS_CR_LKMOD_Msk                                                /*!< Link Mode, for both Links */
#define LVDS_CR_LKPHA_Pos                                      (6U)
#define LVDS_CR_LKPHA_Msk                                      (0x1UL << LVDS_CR_LKPHA_Pos)                                      /*!< 0x00000040 */
#define LVDS_CR_LKPHA                                          LVDS_CR_LKPHA_Msk                                                /*!< Link Phase, for both Links */
#define LVDS_CR_LK1POL_Pos                                     (16U)
#define LVDS_CR_LK1POL_Msk                                     (0x1FUL << LVDS_CR_LK1POL_Pos)                                    /*!< 0x001F0000 */
#define LVDS_CR_LK1POL                                         LVDS_CR_LK1POL_Msk                                               /*!< Link-1 output Polarity, defined per output Data/Clock Lane, from Lane-[4:0] */
#define LVDS_CR_LK1POL_0                                       (0x1UL << LVDS_CR_LK1POL_Pos)                                 /*!< 0x00010000 */
#define LVDS_CR_LK1POL_1                                       (0x2UL << LVDS_CR_LK1POL_Pos)                                 /*!< 0x00020000 */
#define LVDS_CR_LK1POL_2                                       (0x4UL << LVDS_CR_LK1POL_Pos)                                 /*!< 0x00040000 */
#define LVDS_CR_LK1POL_3                                       (0x8UL << LVDS_CR_LK1POL_Pos)                                 /*!< 0x00080000 */
#define LVDS_CR_LK1POL_4                                       (0x10UL << LVDS_CR_LK1POL_Pos)                                /*!< 0x00100000 */
#define LVDS_CR_LK2POL_Pos                                     (21U)
#define LVDS_CR_LK2POL_Msk                                     (0x1FUL << LVDS_CR_LK2POL_Pos)                                    /*!< 0x03E00000 */
#define LVDS_CR_LK2POL                                         LVDS_CR_LK2POL_Msk                                               /*!< Link-2 output Polarity, defined per output Data/Clock Lane, from Lane-[4:0] */
#define LVDS_CR_LK2POL_0                                       (0x1UL << LVDS_CR_LK2POL_Pos)                                /*!< 0x00200000 */
#define LVDS_CR_LK2POL_1                                       (0x2UL << LVDS_CR_LK2POL_Pos)                                /*!< 0x00400000 */
#define LVDS_CR_LK2POL_2                                       (0x4UL << LVDS_CR_LK2POL_Pos)                                /*!< 0x00800000 */
#define LVDS_CR_LK2POL_3                                       (0x8UL << LVDS_CR_LK2POL_Pos)                               /*!< 0x01000000 */
#define LVDS_CR_LK2POL_4                                       (0x10UL << LVDS_CR_LK2POL_Pos)                               /*!< 0x02000000 */

/*****************  Bit definition for LVDS_DMLCR0 register  ******************/
#define LVDS_DMLCR0_MAP0_Pos                                   (0U)
#define LVDS_DMLCR0_MAP0_Msk                                   (0x1FUL << LVDS_DMLCR0_MAP0_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMLCR0_MAP0                                       LVDS_DMLCR0_MAP0_Msk                                             /*!< Mapping for bit 0 of that DataLane. */
#define LVDS_DMLCR0_MAP0_0                                     (0x1UL << LVDS_DMLCR0_MAP0_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMLCR0_MAP0_1                                     (0x2UL << LVDS_DMLCR0_MAP0_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMLCR0_MAP0_2                                     (0x4UL << LVDS_DMLCR0_MAP0_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMLCR0_MAP0_3                                     (0x8UL << LVDS_DMLCR0_MAP0_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMLCR0_MAP0_4                                     (0x10UL << LVDS_DMLCR0_MAP0_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMLCR0_MAP1_Pos                                   (5U)
#define LVDS_DMLCR0_MAP1_Msk                                   (0x1FUL << LVDS_DMLCR0_MAP1_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMLCR0_MAP1                                       LVDS_DMLCR0_MAP1_Msk                                             /*!< Mapping for bit 1 of that DataLane. */
#define LVDS_DMLCR0_MAP1_0                                     (0x1UL << LVDS_DMLCR0_MAP1_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMLCR0_MAP1_1                                     (0x2UL << LVDS_DMLCR0_MAP1_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMLCR0_MAP1_2                                     (0x4UL << LVDS_DMLCR0_MAP1_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMLCR0_MAP1_3                                     (0x8UL << LVDS_DMLCR0_MAP1_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMLCR0_MAP1_4                                     (0x10UL << LVDS_DMLCR0_MAP1_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMLCR0_MAP2_Pos                                   (10U)
#define LVDS_DMLCR0_MAP2_Msk                                   (0x1FUL << LVDS_DMLCR0_MAP2_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMLCR0_MAP2                                       LVDS_DMLCR0_MAP2_Msk                                             /*!< Mapping for bit 2 of that DataLane. */
#define LVDS_DMLCR0_MAP2_0                                     (0x1UL << LVDS_DMLCR0_MAP2_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMLCR0_MAP2_1                                     (0x2UL << LVDS_DMLCR0_MAP2_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMLCR0_MAP2_2                                     (0x4UL << LVDS_DMLCR0_MAP2_Pos)                                /*!< 0x00001000 */
#define LVDS_DMLCR0_MAP2_3                                     (0x8UL << LVDS_DMLCR0_MAP2_Pos)                                /*!< 0x00002000 */
#define LVDS_DMLCR0_MAP2_4                                     (0x10UL << LVDS_DMLCR0_MAP2_Pos)                                /*!< 0x00004000 */
#define LVDS_DMLCR0_MAP3_Pos                                   (15U)
#define LVDS_DMLCR0_MAP3_Msk                                   (0x1FUL << LVDS_DMLCR0_MAP3_Pos)                                  /*!< 0x000F8000 */
#define LVDS_DMLCR0_MAP3                                       LVDS_DMLCR0_MAP3_Msk                                             /*!< Mapping for bit 3 of that DataLane. */
#define LVDS_DMLCR0_MAP3_0                                     (0x1UL << LVDS_DMLCR0_MAP3_Pos)                                /*!< 0x00008000 */
#define LVDS_DMLCR0_MAP3_1                                     (0x2UL << LVDS_DMLCR0_MAP3_Pos)                               /*!< 0x00010000 */
#define LVDS_DMLCR0_MAP3_2                                     (0x4UL << LVDS_DMLCR0_MAP3_Pos)                               /*!< 0x00020000 */
#define LVDS_DMLCR0_MAP3_3                                     (0x8UL << LVDS_DMLCR0_MAP3_Pos)                               /*!< 0x00040000 */
#define LVDS_DMLCR0_MAP3_4                                     (0x10UL << LVDS_DMLCR0_MAP3_Pos)                               /*!< 0x00080000 */

/*****************  Bit definition for LVDS_DMMCR0 register  ******************/
#define LVDS_DMMCR0_MAP4_Pos                                   (0U)
#define LVDS_DMMCR0_MAP4_Msk                                   (0x1FUL << LVDS_DMMCR0_MAP4_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMMCR0_MAP4                                       LVDS_DMMCR0_MAP4_Msk                                             /*!< Mapping for bit 4 of that DataLane. */
#define LVDS_DMMCR0_MAP4_0                                     (0x1UL << LVDS_DMMCR0_MAP4_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMMCR0_MAP4_1                                     (0x2UL << LVDS_DMMCR0_MAP4_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMMCR0_MAP4_2                                     (0x4UL << LVDS_DMMCR0_MAP4_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMMCR0_MAP4_3                                     (0x8UL << LVDS_DMMCR0_MAP4_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMMCR0_MAP4_4                                     (0x10UL << LVDS_DMMCR0_MAP4_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMMCR0_MAP5_Pos                                   (5U)
#define LVDS_DMMCR0_MAP5_Msk                                   (0x1FUL << LVDS_DMMCR0_MAP5_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMMCR0_MAP5                                       LVDS_DMMCR0_MAP5_Msk                                             /*!< Mapping for bit 5 of that DataLane. */
#define LVDS_DMMCR0_MAP5_0                                     (0x1UL << LVDS_DMMCR0_MAP5_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMMCR0_MAP5_1                                     (0x2UL << LVDS_DMMCR0_MAP5_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMMCR0_MAP5_2                                     (0x4UL << LVDS_DMMCR0_MAP5_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMMCR0_MAP5_3                                     (0x8UL << LVDS_DMMCR0_MAP5_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMMCR0_MAP5_4                                     (0x10UL << LVDS_DMMCR0_MAP5_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMMCR0_MAP6_Pos                                   (10U)
#define LVDS_DMMCR0_MAP6_Msk                                   (0x1FUL << LVDS_DMMCR0_MAP6_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMMCR0_MAP6                                       LVDS_DMMCR0_MAP6_Msk                                             /*!< Mapping for bit 6 of that DataLane. */
#define LVDS_DMMCR0_MAP6_0                                     (0x1UL << LVDS_DMMCR0_MAP6_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMMCR0_MAP6_1                                     (0x2UL << LVDS_DMMCR0_MAP6_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMMCR0_MAP6_2                                     (0x4UL << LVDS_DMMCR0_MAP6_Pos)                                /*!< 0x00001000 */
#define LVDS_DMMCR0_MAP6_3                                     (0x8UL << LVDS_DMMCR0_MAP6_Pos)                                /*!< 0x00002000 */
#define LVDS_DMMCR0_MAP6_4                                     (0x10UL << LVDS_DMMCR0_MAP6_Pos)                                /*!< 0x00004000 */

