STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_cm33.h
/* Bit fields for PWR_D1CR register */
#define PWR_D1CR_LPCFG_D1_Pos                  (0U)
#define PWR_D1CR_LPCFG_D1_Msk                  (0x1UL << PWR_D1CR_LPCFG_D1_Pos)
#define PWR_D1CR_LPCFG_D1                      PWR_D1CR_LPCFG_D1_Msk  /*!< PWR_CPU_ON pin configuration.- 0: PWR_CPU_ON pin signals DStandby mode (PWR_CPU_ON =1 in DRun, DStop1/2/3, and 0 in DStandby). (pwr_cpu_on)- 1: PWR_CPU_ON pin signals DStandby &amp;amp; DStop2/3 modes (PWR_CPU_ON = 1 in DRun, DStop1, and 0 in DStop2/3 and DStandby). (pwr_cpu_onlp) */
#define PWR_D1CR_POPL_D1_Pos                   (8U)
#define PWR_D1CR_POPL_D1_Msk                   (0x1fUL << PWR_D1CR_POPL_D1_Pos)
#define PWR_D1CR_POPL_D1                       PWR_D1CR_POPL_D1_Msk  /*!< pwr_cpu_on pulse low configuration.These bits are set and cleared by software. They define the minimum guaranteed duration of the pwr_cpu_on low pulse in DStandby mode. (There is no impact on the DSTOP2/3 modes).The LSI oscillator is automatically enabled when needed by the POPL_D1 pulse low configuration.- 00000: No guaranteed minimum low time.- 00001: ~ 1 ms guaranteed minimum low time. (1 x 32 LSI cycles)- 00010: ~ 2 ms guaranteed minimum low time. (2 x 32 LSI cycles)...- 11111: ~ 31 ms guaranteed minimum low time. (31 x 32 LSI cycles) */

/* Bit fields for PWR_D2CR register */
#define PWR_D2CR_LPCFG_D2_Pos                  (0U)
#define PWR_D2CR_LPCFG_D2_Msk                  (0x1UL << PWR_D2CR_LPCFG_D2_Pos)
#define PWR_D2CR_LPCFG_D2                      PWR_D2CR_LPCFG_D2_Msk  /*!< PWR_ON pin configuration.- 0: PWR_ON pin signals Standby modes (PWR_ON =1 in Run, Stop1/2, LP-Stop1/2, LPLV-Stop1/2, and 0 in Standby1/2). (pwr_on)- 1: PWR_ON pin signals Standby &amp;amp; LP-Stop, LPLV-Stop modes (PWR_ CPU_ON = 1 in Run, Stop1/2, and 0 in LP-Stop1/2, LPLV-Stop1/2 and Standby1/2). (pwr_onlp) */
#define PWR_D2CR_POPL_D2_Pos                   (8U)
#define PWR_D2CR_POPL_D2_Msk                   (0x1fUL << PWR_D2CR_POPL_D2_Pos)
#define PWR_D2CR_POPL_D2                       PWR_D2CR_POPL_D2_Msk  /*!< pwr_on pulse low configuration.These bits are set and cleared by software. They define the minimum guaranteed duration of the pwr_on low pulse in Standby mode. (There is no impact on the LP-Stop and LPLV-Stop modes).The LSI oscillator is automatically enabled when needed by the POPL_D2 pulse low configuration.- 00000: No guaranteed minimum low time.- 00001: ~ 1 ms guaranteed minimum low time. (1 x 32 LSI cycles)- 00010: ~ 2 ms guaranteed minimum low time. (2 x 32 LSI cycles)...- 11111: ~ 31 ms guaranteed minimum low time. (31 x 32 LSI cycles) */
#define PWR_D2CR_LPLVDLY_D2_Pos                (16U)
#define PWR_D2CR_LPLVDLY_D2_Msk                (0x7UL << PWR_D2CR_LPLVDLY_D2_Pos)
#define PWR_D2CR_LPLVDLY_D2                    PWR_D2CR_LPLVDLY_D2_Msk
#define PWR_D2CR_PODH_D2_Pos                   (24U)
#define PWR_D2CR_PODH_D2_Msk                   (0xFUL << PWR_D2CR_PODH_D2_Pos)
#define PWR_D2CR_PODH_D2                       PWR_D2CR_PODH_D2_Msk

/* Bit fields for PWR_D3CR register */
#define PWR_D3CR_PDDS_D3_Pos                   (0U)
#define PWR_D3CR_PDDS_D3_Msk                   (0x1UL << PWR_D3CR_PDDS_D3_Pos)
#define PWR_D3CR_PDDS_D3                       PWR_D3CR_PDDS_D3_Msk  /*!< D3 domain Power Down Deepsleep selection. This bit has only effect when the EN_D3 bit is not set.- 0: Keep SStop mode when system enters to Standby.- 1: Allow SStandby mode when system enters to Standby. */
#define PWR_D3CR_D3RDY_Pos                     (31U)
#define PWR_D3CR_D3RDY_Msk                     (0x1UL << PWR_D3CR_D3RDY_Pos)
#define PWR_D3CR_D3RDY                         PWR_D3CR_D3RDY_Msk  /*!< D3 domain supply ready.This bit is set when the domain is accessible- 0: D3 domain not ready- 1: D3 domain ready. */

/* Bit fields for PWR_WKUPCR1 register */
#define PWR_WKUPCR1_WKUPC_Pos                  (0U)
#define PWR_WKUPCR1_WKUPC_Msk                  (0x1UL << PWR_WKUPCR1_WKUPC_Pos)
#define PWR_WKUPCR1_WKUPC                      PWR_WKUPCR1_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR1_WKUPP_Pos                  (8U)
#define PWR_WKUPCR1_WKUPP_Msk                  (0x1UL << PWR_WKUPCR1_WKUPP_Pos)
#define PWR_WKUPCR1_WKUPP                      PWR_WKUPCR1_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR1_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR1_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR1_WKUPPUPD_Pos)
#define PWR_WKUPCR1_WKUPPUPD                   PWR_WKUPCR1_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR1_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR1_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR1_WKUPENCPU1_Pos)
#define PWR_WKUPCR1_WKUPENCPU1                 PWR_WKUPCR1_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR1_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR1_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR1_WKUPENCPU2_Pos)
#define PWR_WKUPCR1_WKUPENCPU2                 PWR_WKUPCR1_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR1_WKUPF_Pos                  (31U)
#define PWR_WKUPCR1_WKUPF_Msk                  (0x1UL << PWR_WKUPCR1_WKUPF_Pos)
#define PWR_WKUPCR1_WKUPF                      PWR_WKUPCR1_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

