STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_cm33.h
/* Bit fields for RCC_SECCFGR3 register */
#define RCC_SECCFGR3_SEC_Pos                         (0U)
#define RCC_SECCFGR3_SEC_Msk                         (0x3FFFFUL << RCC_SECCFGR3_SEC_Pos)                    /*!< 0x0003FFFF */
#define RCC_SECCFGR3_SEC                             RCC_SECCFGR3_SEC_Msk                                  /*!< Secure attribute reference for the local resource number x */

/* Bit fields for RCC_PRIVCFGR0 register */
#define RCC_PRIVCFGR0_PRIV_Pos                       (0U)
#define RCC_PRIVCFGR0_PRIV_Msk                       (0xFFFFFFFFUL << RCC_PRIVCFGR0_PRIV_Pos)               /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR0_PRIV                           RCC_PRIVCFGR0_PRIV_Msk                                /*!< Privileged attribute reference for local resource number x */

/* Bit fields for RCC_PRIVCFGR1 register */
#define RCC_PRIVCFGR1_PRIV_Pos                       (0U)
#define RCC_PRIVCFGR1_PRIV_Msk                       (0xFFFFFFFFUL << RCC_PRIVCFGR1_PRIV_Pos)               /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR1_PRIV                           RCC_PRIVCFGR1_PRIV_Msk                                /*!< Privileged attribute reference for the local resource number x */

/* Bit fields for RCC_PRIVCFGR2 register */
#define RCC_PRIVCFGR2_PRIV_Pos                       (0U)
#define RCC_PRIVCFGR2_PRIV_Msk                       (0xFFFFFFFFUL << RCC_PRIVCFGR2_PRIV_Pos)               /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR2_PRIV                           RCC_PRIVCFGR2_PRIV_Msk                                /*!< Privileged attribute reference for the local resource number x */

/* Bit fields for RCC_PRIVCFGR3 register */
#define RCC_PRIVCFGR3_PRIV_Pos                       (0U)
#define RCC_PRIVCFGR3_PRIV_Msk                       (0x3FFFFUL << RCC_PRIVCFGR3_PRIV_Pos)                  /*!< 0x0003FFFF */
#define RCC_PRIVCFGR3_PRIV                           RCC_PRIVCFGR3_PRIV_Msk                                /*!< Privileged attribute reference for the local resource number x */

/* Bit fields for RCC_RCFGLOCK0 register */
#define RCC_RCFGLOCK0_RLOCK_Pos                      (0U)
#define RCC_RCFGLOCK0_RLOCK_Msk                      (0xFFFFFFFFUL << RCC_RCFGLOCK0_RLOCK_Pos)
#define RCC_RCFGLOCK0_RLOCK                          RCC_RCFGLOCK0_RLOCK_Msk

/* Bit fields for RCC_RCFGLOCK1 register */
#define RCC_RCFGLOCK1_RLOCK_Pos                      (0U)
#define RCC_RCFGLOCK1_RLOCK_Msk                      (0xFFFFFFFFUL << RCC_RCFGLOCK1_RLOCK_Pos)
#define RCC_RCFGLOCK1_RLOCK                          RCC_RCFGLOCK1_RLOCK_Msk

/* Bit fields for RCC_RCFGLOCK2 register */
#define RCC_RCFGLOCK2_RLOCK_Pos                      (0U)
#define RCC_RCFGLOCK2_RLOCK_Msk                      (0xFFFFFFFFUL << RCC_RCFGLOCK2_RLOCK_Pos)
#define RCC_RCFGLOCK2_RLOCK                          RCC_RCFGLOCK2_RLOCK_Msk

/* Bit fields for RCC_RCFGLOCK3 register */
#define RCC_RCFGLOCK3_RLOCK_Pos                      (0U)
#define RCC_RCFGLOCK3_RLOCK_Msk                      (0x3FFFFUL  << RCC_RCFGLOCK3_RLOCK_Pos)
#define RCC_RCFGLOCK3_RLOCK                          RCC_RCFGLOCK3_RLOCK

/* Bit fields for RCC_RxCIDCFGR registers (x in [0;113] */
#define RCC_RxCIDCFGR_CFEN_Pos                       (0U)
#define RCC_RxCIDCFGR_CFEN_Msk                       (0x1UL << RCC_RxCIDCFGR_CFEN_Pos)
#define RCC_RxCIDCFGR_CFEN                           RCC_RxCIDCFGR_CFEN_Msk
#define RCC_RxCIDCFGR_SEM_EN_Pos                     (1U)
#define RCC_RxCIDCFGR_SEM_EN_Msk                     (0x1UL << RCC_RxCIDCFGR_SEM_EN_Pos)
#define RCC_RxCIDCFGR_SEM_EN                         RCC_RxCIDCFGR_SEM_EN_Msk
#define RCC_RxCIDCFGR_SCID_Pos                       (4U)
#define RCC_RxCIDCFGR_SCID_Msk                       (0x7UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_0                         (0x0UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_1                         (0x1UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_2                         (0x2UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_3                         (0x3UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_4                         (0x4UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_5                         (0x5UL << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_6                         (0x6UL  << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SCID_7                         (0x7UL  << RCC_RxCIDCFGR_SCID_Pos)
#define RCC_RxCIDCFGR_SEMWLC_Pos                     (16U)
#define RCC_RxCIDCFGR_SEMWLC_Msk                     (0xFFUL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID0                    (0x01UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID1                    (0x02UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID2                    (0x04UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID3                    (0x08UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID4                    (0x10UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID5                    (0x20UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID6                    (0x40UL  << RCC_RxCIDCFGR_SEMWLC_Pos)
#define RCC_RxCIDCFGR_SEMWLC_CID7                    (0x80UL  << RCC_RxCIDCFGR_SEMWLC_Pos)

/* Bit fields for RCC_RxSEMCR registers (x in [0;113] */
#define RCC_RxSEMCR_SEM_MUTEX_Pos                    (0U)
#define RCC_RxSEMCR_SEM_MUTEX_Msk                    (0x1UL << RCC_RxSEMCR_SEM_MUTEX_Pos)
#define RCC_RxSEMCR_SEM_MUTEX                        RCC_RxSEMCR_SEM_MUTEX_Msk
#define RCC_RxSEMCR_SEMCID_Pos                       (4U)
#define RCC_RxSEMCR_SEMCID_Msk                       (0x7UL  << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_0                         (0x0UL  << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_1                         (0x1UL << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_2                         (0x2UL << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_3                         (0x3UL << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_4                         (0x4UL << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_5                         (0x5UL << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_6                         (0x6UL  << RCC_RxSEMCR_SEMCID_Pos)
#define RCC_RxSEMCR_SEMCID_7                         (0x7UL  << RCC_RxSEMCR_SEMCID_Pos)

