STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_cm33.h
/******************  Bit definition for SERC_ICR3 register  *******************/
#define SERC_ICR3_PDRC96_Pos         (0U)
#define SERC_ICR3_PDRC96_Msk         (0x1UL << SERC_ICR3_PDRC96_Pos)    /*!< 0x00000001 */
#define SERC_ICR3_PDRC96             SERC_ICR3_PDRC96_Msk
#define SERC_ICR3_PDRC97_Pos         (1U)
#define SERC_ICR3_PDRC97_Msk         (0x1UL << SERC_ICR3_PDRC97_Pos)    /*!< 0x00000002 */
#define SERC_ICR3_PDRC97             SERC_ICR3_PDRC97_Msk
#define SERC_ICR3_PDRC98_Pos         (2U)
#define SERC_ICR3_PDRC98_Msk         (0x1UL << SERC_ICR3_PDRC98_Pos)    /*!< 0x00000004 */
#define SERC_ICR3_PDRC98             SERC_ICR3_PDRC98_Msk
#define SERC_ICR3_PDRC99_Pos         (3U)
#define SERC_ICR3_PDRC99_Msk         (0x1UL << SERC_ICR3_PDRC99_Pos)    /*!< 0x00000008 */
#define SERC_ICR3_PDRC99             SERC_ICR3_PDRC99_Msk
#define SERC_ICR3_PDRC100_Pos        (4U)
#define SERC_ICR3_PDRC100_Msk        (0x1UL << SERC_ICR3_PDRC100_Pos)   /*!< 0x00000010 */
#define SERC_ICR3_PDRC100            SERC_ICR3_PDRC100_Msk
#define SERC_ICR3_PDRC101_Pos        (5U)
#define SERC_ICR3_PDRC101_Msk        (0x1UL << SERC_ICR3_PDRC101_Pos)   /*!< 0x00000020 */
#define SERC_ICR3_PDRC101            SERC_ICR3_PDRC101_Msk
#define SERC_ICR3_PDRC102_Pos        (6U)
#define SERC_ICR3_PDRC102_Msk        (0x1UL << SERC_ICR3_PDRC102_Pos)   /*!< 0x00000040 */
#define SERC_ICR3_PDRC102            SERC_ICR3_PDRC102_Msk
#define SERC_ICR3_PDRC103_Pos        (7U)
#define SERC_ICR3_PDRC103_Msk        (0x1UL << SERC_ICR3_PDRC103_Pos)   /*!< 0x00000080 */
#define SERC_ICR3_PDRC103            SERC_ICR3_PDRC103_Msk
#define SERC_ICR3_PDRC104_Pos        (8U)
#define SERC_ICR3_PDRC104_Msk        (0x1UL << SERC_ICR3_PDRC104_Pos)   /*!< 0x00000100 */
#define SERC_ICR3_PDRC104            SERC_ICR3_PDRC104_Msk
#define SERC_ICR3_PDRC105_Pos        (9U)
#define SERC_ICR3_PDRC105_Msk        (0x1UL << SERC_ICR3_PDRC105_Pos)   /*!< 0x00000200 */
#define SERC_ICR3_PDRC105            SERC_ICR3_PDRC105_Msk
#define SERC_ICR3_PDRC106_Pos        (10U)
#define SERC_ICR3_PDRC106_Msk        (0x1UL << SERC_ICR3_PDRC106_Pos)   /*!< 0x00000400 */
#define SERC_ICR3_PDRC106            SERC_ICR3_PDRC106_Msk
#define SERC_ICR3_PDRC107_Pos        (11U)
#define SERC_ICR3_PDRC107_Msk        (0x1UL << SERC_ICR3_PDRC107_Pos)   /*!< 0x00000800 */
#define SERC_ICR3_PDRC107            SERC_ICR3_PDRC107_Msk
#define SERC_ICR3_PDRC108_Pos        (12U)
#define SERC_ICR3_PDRC108_Msk        (0x1UL << SERC_ICR3_PDRC108_Pos)   /*!< 0x00001000 */
#define SERC_ICR3_PDRC108            SERC_ICR3_PDRC108_Msk
#define SERC_ICR3_PDRC109_Pos        (13U)
#define SERC_ICR3_PDRC109_Msk        (0x1UL << SERC_ICR3_PDRC109_Pos)   /*!< 0x00002000 */
#define SERC_ICR3_PDRC109            SERC_ICR3_PDRC109_Msk
#define SERC_ICR3_PDRC110_Pos        (14U)
#define SERC_ICR3_PDRC110_Msk        (0x1UL << SERC_ICR3_PDRC110_Pos)   /*!< 0x00004000 */
#define SERC_ICR3_PDRC110            SERC_ICR3_PDRC110_Msk
#define SERC_ICR3_PDRC111_Pos        (15U)
#define SERC_ICR3_PDRC111_Msk        (0x1UL << SERC_ICR3_PDRC111_Pos)   /*!< 0x00008000 */
#define SERC_ICR3_PDRC111            SERC_ICR3_PDRC111_Msk
#define SERC_ICR3_PDRC112_Pos        (16U)
#define SERC_ICR3_PDRC112_Msk        (0x1UL << SERC_ICR3_PDRC112_Pos)   /*!< 0x00010000 */
#define SERC_ICR3_PDRC112            SERC_ICR3_PDRC112_Msk
#define SERC_ICR3_PDRC113_Pos        (17U)
#define SERC_ICR3_PDRC113_Msk        (0x1UL << SERC_ICR3_PDRC113_Pos)   /*!< 0x00020000 */
#define SERC_ICR3_PDRC113            SERC_ICR3_PDRC113_Msk
#define SERC_ICR3_PDRC114_Pos        (18U)
#define SERC_ICR3_PDRC114_Msk        (0x1UL << SERC_ICR3_PDRC114_Pos)   /*!< 0x00040000 */
#define SERC_ICR3_PDRC114            SERC_ICR3_PDRC114_Msk
#define SERC_ICR3_PDRC115_Pos        (19U)
#define SERC_ICR3_PDRC115_Msk        (0x1UL << SERC_ICR3_PDRC115_Pos)   /*!< 0x00080000 */
#define SERC_ICR3_PDRC115            SERC_ICR3_PDRC115_Msk
#define SERC_ICR3_PDRC116_Pos        (20U)
#define SERC_ICR3_PDRC116_Msk        (0x1UL << SERC_ICR3_PDRC116_Pos)   /*!< 0x00100000 */
#define SERC_ICR3_PDRC116            SERC_ICR3_PDRC116_Msk
#define SERC_ICR3_PDRC117_Pos        (21U)
#define SERC_ICR3_PDRC117_Msk        (0x1UL << SERC_ICR3_PDRC117_Pos)   /*!< 0x00200000 */
#define SERC_ICR3_PDRC117            SERC_ICR3_PDRC117_Msk
#define SERC_ICR3_PDRC118_Pos        (22U)
#define SERC_ICR3_PDRC118_Msk        (0x1UL << SERC_ICR3_PDRC118_Pos)   /*!< 0x00400000 */
#define SERC_ICR3_PDRC118            SERC_ICR3_PDRC118_Msk
#define SERC_ICR3_PDRC119_Pos        (23U)
#define SERC_ICR3_PDRC119_Msk        (0x1UL << SERC_ICR3_PDRC119_Pos)   /*!< 0x00800000 */
#define SERC_ICR3_PDRC119            SERC_ICR3_PDRC119_Msk
#define SERC_ICR3_PDRC120_Pos        (24U)
#define SERC_ICR3_PDRC120_Msk        (0x1UL << SERC_ICR3_PDRC120_Pos)   /*!< 0x01000000 */
#define SERC_ICR3_PDRC120            SERC_ICR3_PDRC120_Msk
#define SERC_ICR3_PDRC121_Pos        (25U)
#define SERC_ICR3_PDRC121_Msk        (0x1UL << SERC_ICR3_PDRC121_Pos)   /*!< 0x02000000 */
#define SERC_ICR3_PDRC121            SERC_ICR3_PDRC121_Msk
#define SERC_ICR3_PDRC122_Pos        (26U)
#define SERC_ICR3_PDRC122_Msk        (0x1UL << SERC_ICR3_PDRC122_Pos)   /*!< 0x04000000 */
#define SERC_ICR3_PDRC122            SERC_ICR3_PDRC122_Msk
#define SERC_ICR3_PDRC123_Pos        (27U)
#define SERC_ICR3_PDRC123_Msk        (0x1UL << SERC_ICR3_PDRC123_Pos)   /*!< 0x08000000 */
#define SERC_ICR3_PDRC123            SERC_ICR3_PDRC123_Msk
#define SERC_ICR3_PDRC124_Pos        (28U)
#define SERC_ICR3_PDRC124_Msk        (0x1UL << SERC_ICR3_PDRC124_Pos)   /*!< 0x10000000 */
#define SERC_ICR3_PDRC124            SERC_ICR3_PDRC124_Msk
#define SERC_ICR3_PDRC125_Pos        (29U)
#define SERC_ICR3_PDRC125_Msk        (0x1UL << SERC_ICR3_PDRC125_Pos)   /*!< 0x20000000 */
#define SERC_ICR3_PDRC125            SERC_ICR3_PDRC125_Msk
#define SERC_ICR3_PDRC126_Pos        (30U)
#define SERC_ICR3_PDRC126_Msk        (0x1UL << SERC_ICR3_PDRC126_Pos)   /*!< 0x40000000 */
#define SERC_ICR3_PDRC126            SERC_ICR3_PDRC126_Msk
#define SERC_ICR3_PDRC127_Pos        (31U)
#define SERC_ICR3_PDRC127_Msk        (0x1UL << SERC_ICR3_PDRC127_Pos)   /*!< 0x80000000 */
#define SERC_ICR3_PDRC127            SERC_ICR3_PDRC127_Msk

/******************  Bit definition for SERC_ICR4 register  *******************/
#define SERC_ICR4_PDRC128_Pos        (0U)
#define SERC_ICR4_PDRC128_Msk        (0x1UL << SERC_ICR4_PDRC128_Pos)   /*!< 0x00000001 */
#define SERC_ICR4_PDRC128            SERC_ICR4_PDRC128_Msk
#define SERC_ICR4_PDRC129_Pos        (1U)
#define SERC_ICR4_PDRC129_Msk        (0x1UL << SERC_ICR4_PDRC129_Pos)   /*!< 0x00000002 */
#define SERC_ICR4_PDRC129            SERC_ICR4_PDRC129_Msk
#define SERC_ICR4_PDRC130_Pos        (2U)
#define SERC_ICR4_PDRC130_Msk        (0x1UL << SERC_ICR4_PDRC130_Pos)   /*!< 0x00000004 */
#define SERC_ICR4_PDRC130            SERC_ICR4_PDRC130_Msk
#define SERC_ICR4_PDRC131_Pos        (3U)
#define SERC_ICR4_PDRC131_Msk        (0x1UL << SERC_ICR4_PDRC131_Pos)   /*!< 0x00000008 */
#define SERC_ICR4_PDRC131            SERC_ICR4_PDRC131_Msk
#define SERC_ICR4_PDRC132_Pos        (4U)
#define SERC_ICR4_PDRC132_Msk        (0x1UL << SERC_ICR4_PDRC132_Pos)   /*!< 0x00000010 */
#define SERC_ICR4_PDRC132            SERC_ICR4_PDRC132_Msk
#define SERC_ICR4_PDRC133_Pos        (5U)
#define SERC_ICR4_PDRC133_Msk        (0x1UL << SERC_ICR4_PDRC133_Pos)   /*!< 0x00000020 */
#define SERC_ICR4_PDRC133            SERC_ICR4_PDRC133_Msk
#define SERC_ICR4_PDRC134_Pos        (6U)
#define SERC_ICR4_PDRC134_Msk        (0x1UL << SERC_ICR4_PDRC134_Pos)   /*!< 0x00000040 */
#define SERC_ICR4_PDRC134            SERC_ICR4_PDRC134_Msk
#define SERC_ICR4_PDRC135_Pos        (7U)
#define SERC_ICR4_PDRC135_Msk        (0x1UL << SERC_ICR4_PDRC135_Pos)   /*!< 0x00000080 */
#define SERC_ICR4_PDRC135            SERC_ICR4_PDRC135_Msk
#define SERC_ICR4_PDRC136_Pos        (8U)
#define SERC_ICR4_PDRC136_Msk        (0x1UL << SERC_ICR4_PDRC136_Pos)   /*!< 0x00000100 */
#define SERC_ICR4_PDRC136            SERC_ICR4_PDRC136_Msk
#define SERC_ICR4_PDRC137_Pos        (9U)
#define SERC_ICR4_PDRC137_Msk        (0x1UL << SERC_ICR4_PDRC137_Pos)   /*!< 0x00000200 */
#define SERC_ICR4_PDRC137            SERC_ICR4_PDRC137_Msk
#define SERC_ICR4_PDRC138_Pos        (10U)
#define SERC_ICR4_PDRC138_Msk        (0x1UL << SERC_ICR4_PDRC138_Pos)   /*!< 0x00000400 */
#define SERC_ICR4_PDRC138            SERC_ICR4_PDRC138_Msk
#define SERC_ICR4_PDRC139_Pos        (11U)
#define SERC_ICR4_PDRC139_Msk        (0x1UL << SERC_ICR4_PDRC139_Pos)   /*!< 0x00000800 */
#define SERC_ICR4_PDRC139            SERC_ICR4_PDRC139_Msk
#define SERC_ICR4_PDRC140_Pos        (12U)
#define SERC_ICR4_PDRC140_Msk        (0x1UL << SERC_ICR4_PDRC140_Pos)   /*!< 0x00001000 */
#define SERC_ICR4_PDRC140            SERC_ICR4_PDRC140_Msk
#define SERC_ICR4_PDRC141_Pos        (13U)
#define SERC_ICR4_PDRC141_Msk        (0x1UL << SERC_ICR4_PDRC141_Pos)   /*!< 0x00002000 */
#define SERC_ICR4_PDRC141            SERC_ICR4_PDRC141_Msk
#define SERC_ICR4_PDRC142_Pos        (14U)
#define SERC_ICR4_PDRC142_Msk        (0x1UL << SERC_ICR4_PDRC142_Pos)   /*!< 0x00004000 */
#define SERC_ICR4_PDRC142            SERC_ICR4_PDRC142_Msk
#define SERC_ICR4_PDRC143_Pos        (15U)
#define SERC_ICR4_PDRC143_Msk        (0x1UL << SERC_ICR4_PDRC143_Pos)   /*!< 0x00008000 */
#define SERC_ICR4_PDRC143            SERC_ICR4_PDRC143_Msk
#define SERC_ICR4_PDRC144_Pos        (16U)
#define SERC_ICR4_PDRC144_Msk        (0x1UL << SERC_ICR4_PDRC144_Pos)   /*!< 0x00010000 */
#define SERC_ICR4_PDRC144            SERC_ICR4_PDRC144_Msk
#define SERC_ICR4_PDRC145_Pos        (17U)
#define SERC_ICR4_PDRC145_Msk        (0x1UL << SERC_ICR4_PDRC145_Pos)   /*!< 0x00020000 */
#define SERC_ICR4_PDRC145            SERC_ICR4_PDRC145_Msk
#define SERC_ICR4_PDRC146_Pos        (18U)
#define SERC_ICR4_PDRC146_Msk        (0x1UL << SERC_ICR4_PDRC146_Pos)   /*!< 0x00040000 */
#define SERC_ICR4_PDRC146            SERC_ICR4_PDRC146_Msk
#define SERC_ICR4_PDRC147_Pos        (19U)
#define SERC_ICR4_PDRC147_Msk        (0x1UL << SERC_ICR4_PDRC147_Pos)   /*!< 0x00080000 */
#define SERC_ICR4_PDRC147            SERC_ICR4_PDRC147_Msk
#define SERC_ICR4_PDRC148_Pos        (20U)
#define SERC_ICR4_PDRC148_Msk        (0x1UL << SERC_ICR4_PDRC148_Pos)   /*!< 0x00100000 */
#define SERC_ICR4_PDRC148            SERC_ICR4_PDRC148_Msk
#define SERC_ICR4_PDRC149_Pos        (21U)
#define SERC_ICR4_PDRC149_Msk        (0x1UL << SERC_ICR4_PDRC149_Pos)   /*!< 0x00200000 */
#define SERC_ICR4_PDRC149            SERC_ICR4_PDRC149_Msk
#define SERC_ICR4_PDRC150_Pos        (22U)
#define SERC_ICR4_PDRC150_Msk        (0x1UL << SERC_ICR4_PDRC150_Pos)   /*!< 0x00400000 */
#define SERC_ICR4_PDRC150            SERC_ICR4_PDRC150_Msk
#define SERC_ICR4_PDRC151_Pos        (23U)
#define SERC_ICR4_PDRC151_Msk        (0x1UL << SERC_ICR4_PDRC151_Pos)   /*!< 0x00800000 */
#define SERC_ICR4_PDRC151            SERC_ICR4_PDRC151_Msk
#define SERC_ICR4_PDRC152_Pos        (24U)
#define SERC_ICR4_PDRC152_Msk        (0x1UL << SERC_ICR4_PDRC152_Pos)   /*!< 0x01000000 */
#define SERC_ICR4_PDRC152            SERC_ICR4_PDRC152_Msk
#define SERC_ICR4_PDRC153_Pos        (25U)
#define SERC_ICR4_PDRC153_Msk        (0x1UL << SERC_ICR4_PDRC153_Pos)   /*!< 0x02000000 */
#define SERC_ICR4_PDRC153            SERC_ICR4_PDRC153_Msk
#define SERC_ICR4_PDRC154_Pos        (26U)
#define SERC_ICR4_PDRC154_Msk        (0x1UL << SERC_ICR4_PDRC154_Pos)   /*!< 0x04000000 */
#define SERC_ICR4_PDRC154            SERC_ICR4_PDRC154_Msk
#define SERC_ICR4_PDRC155_Pos        (27U)
#define SERC_ICR4_PDRC155_Msk        (0x1UL << SERC_ICR4_PDRC155_Pos)   /*!< 0x08000000 */
#define SERC_ICR4_PDRC155            SERC_ICR4_PDRC155_Msk
#define SERC_ICR4_PDRC156_Pos        (28U)
#define SERC_ICR4_PDRC156_Msk        (0x1UL << SERC_ICR4_PDRC156_Pos)   /*!< 0x10000000 */
#define SERC_ICR4_PDRC156            SERC_ICR4_PDRC156_Msk
#define SERC_ICR4_PDRC157_Pos        (29U)
#define SERC_ICR4_PDRC157_Msk        (0x1UL << SERC_ICR4_PDRC157_Pos)   /*!< 0x20000000 */
#define SERC_ICR4_PDRC157            SERC_ICR4_PDRC157_Msk
#define SERC_ICR4_PDRC158_Pos        (30U)
#define SERC_ICR4_PDRC158_Msk        (0x1UL << SERC_ICR4_PDRC158_Pos)   /*!< 0x40000000 */
#define SERC_ICR4_PDRC158            SERC_ICR4_PDRC158_Msk
#define SERC_ICR4_PDRC159_Pos        (31U)
#define SERC_ICR4_PDRC159_Msk        (0x1UL << SERC_ICR4_PDRC159_Pos)   /*!< 0x80000000 */
#define SERC_ICR4_PDRC159            SERC_ICR4_PDRC159_Msk

